; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared0 - mode
	thermograph5 - mode
	spectrograph2 - mode
	infrared4 - mode
	image1 - mode
	infrared6 - mode
	image3 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	GroundStation2 - direction
	Star4 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared4)
	(supports instrument0 thermograph5)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star8)
	(supports instrument1 spectrograph2)
	(supports instrument1 image3)
	(supports instrument1 infrared6)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
)
(:goal (and
	(pointing satellite0 Planet10)
	(have_image Phenomenon9 image3)
	(have_image Phenomenon9 infrared6)
	(have_image Planet10 image3)
	(have_image Phenomenon11 infrared4)
	(have_image Phenomenon11 infrared0)
	(have_image Planet12 thermograph5)
	(have_image Star13 infrared4)
	(have_image Star13 image1)
	(have_image Planet14 infrared0)
	(have_image Planet14 spectrograph2)
	(have_image Star15 infrared6)
	(have_image Star15 image3)
))

)

; plan
1. (turn_to satellite0 groundstation2 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 13
4. (turn_to satellite0 star13 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star13)
   goals met: 0 of 13
5. (take_image satellite0 star13 instrument0 infrared4)
   added: (have_image star13 infrared4)
   goals met: 1 of 13
6. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 2 of 13
7. (turn_to satellite0 planet12 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 planet12)
   goals met: 2 of 13
8. (take_image satellite0 planet12 instrument0 thermograph5)
   added: (have_image planet12 thermograph5)
   goals met: 3 of 13
9. (turn_to satellite0 phenomenon11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 13
10. (take_image satellite0 phenomenon11 instrument0 infrared4)
   added: (have_image phenomenon11 infrared4)
   goals met: 4 of 13
11. (turn_to satellite0 star8 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star8)
   goals met: 4 of 13
12. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 13
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 13
14. (calibrate satellite0 instrument1 star8)
   added: (calibrated instrument1)
   goals met: 4 of 13
15. (turn_to satellite0 phenomenon11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 13
16. (take_image satellite0 phenomenon11 instrument1 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 5 of 13
17. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 13
18. (take_image satellite0 phenomenon9 instrument1 image3)
   added: (have_image phenomenon9 image3)
   goals met: 6 of 13
19. (take_image satellite0 phenomenon9 instrument1 infrared6)
   added: (have_image phenomenon9 infrared6)
   goals met: 7 of 13
20. (turn_to satellite0 planet14 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet14)
   goals met: 7 of 13
21. (take_image satellite0 planet14 instrument1 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 8 of 13
22. (take_image satellite0 planet14 instrument1 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 9 of 13
23. (turn_to satellite0 star15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star15)
   goals met: 9 of 13
24. (take_image satellite0 star15 instrument1 image3)
   added: (have_image star15 image3)
   goals met: 10 of 13
25. (take_image satellite0 star15 instrument1 infrared6)
   added: (have_image star15 infrared6)
   goals met: 11 of 13
26. (turn_to satellite0 planet10 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet10)
   goals met: 12 of 13
27. (take_image satellite0 planet10 instrument1 image3)
   added: (have_image planet10 image3)
   goals met: 13 of 13
